import { BookOpen, Calendar } from "lucide-react";
import { useTheme } from "../context/ThemeContext";
import { ReactNode } from "react";

interface ChapterCardProps {
  title: string;
  date: string;
  content: ReactNode;
}

const StoriesKH = () => {
  const { theme } = useTheme();

  const ChapterCard = ({ title, date, content }: ChapterCardProps) => (
    <div
      className={`bg-white/10 backdrop-blur-sm rounded-2xl shadow-xl mb-8 transform transition-all duration-300 hover:scale-[1.01] ${
        theme === "dark"
          ? "bg-opacity-10 shadow-gray-900 hover:shadow-pink-900/20"
          : "bg-opacity-50 shadow-gray-200 hover:shadow-pink-500/20"
      }`}
    >
      <div className="p-6">
        <div className="flex items-center mb-6">
          <div
            className={`flex items-center justify-center w-12 h-12 rounded-full mr-4 transition-all duration-300 ${
              theme === "dark" ? "bg-pink-900" : "bg-pink-100"
            }`}
          >
            <BookOpen
              className={`transition-all duration-300 ${
                theme === "dark" ? "text-pink-300" : "text-pink-600"
              }`}
              size={20}
            />
          </div>
          <div className="flex-1">
            <h2 className="text-2xl font-bold mb-2 text-transparent bg-clip-text bg-gradient-to-r from-pink-500 to-purple-600">
              {title}
            </h2>
            <div className="flex items-center">
              <Calendar
                size={16}
                className={`${
                  theme === "dark" ? "text-pink-400" : "text-pink-600"
                }`}
              />
              <p
                className={`ml-2 text-base font-medium ${
                  theme === "dark" ? "text-pink-300" : "text-pink-600"
                }`}
              >
                {date}
              </p>
            </div>
          </div>
        </div>

        <div
          className={`prose lg:prose-lg ${
            theme === "dark" ? "prose-invert" : ""
          } max-w-none`}
        >
          {content}
        </div>
      </div>
    </div>
  );
  return (
    <div className="w-full">
      <div className="container max-w-4xl mx-auto px-6 pb-24">
        <ChapterCard
          title="Chapter 1: ថ្ងៃដែរអ្វីគ្រប់យ៉ាងបានចាប់ផ្ដើម"
          date="កុម្ភ: ១៦ ២០២៥"
          content={
            <>
              <p className="text-lg leading-relaxed">
                ថ្ងៃដែរអ្វីគ្រប់យ៉ាងបានចាប់ផ្ដើម:
              </p>

              <p className="text-lg leading-relaxed mt-4">
                វាជាថ្ងៃសៅរ៍ទី 15 ខែកុម្ភៈដែលជាចុងសប្តាហ៍បណ្ណាល័យ នៃសាលា។
                ថ្ងៃនោះពោរពេញទៅដោយការសើចសប្បាយ និងបរិយាកាសរីករាយ។
                វាគឺជាថ្ងៃចុងសប្តាហ៍ដ៏សប្បាយរីករាយមួយ។ ជិតដល់ម៉ោងបិទ
                អ្នកស្ម័គ្រចិត្តភាគច្រើនបានចាកចេញហើយ។ មានតែយើងពីរនាក់ប៉ុណ្ណោះ
                ជាអ្នកនៅរៀបចំកន្លែង គឺខ្ញុំនិងមនុស្សស្រីម្នាក់។ នាងមានចិត្តល្អ
                ចូលចិត្តជួយអ្នកដទៃ
                ហើយអ្វីដែលពិសេសជាងគេគឺនាងចូលចិត្តធ្វើអ្វីៗគ្រប់យ៉ាងដោយខ្លួនឯង
                ដូចជាខ្ញុំកាលពីមុនអញ្ចឹង។ យើងនៅរៀបចំជាមួយគ្នា
                បញ្ចប់កិច្ចការចុងក្រោយសម្រាប់ថ្ងៃនោះ។ អំឡុងពេលនោះ
              </p>

              <p className="text-lg leading-relaxed mt-4">
                នាងនិយាយថា នៅថ្ងៃបន្ទាប់ ថ្ងៃអាទិត្យ ទី១៦ ខែកុម្ភៈ ឆ្នាំ២០២៥
                នៅទីនោះ
                នឹងមានបើកថ្នាក់ចិត្តវិទ្យាដែលធ្វើឡើងនៅក្នុងបណ្ណាល័យទាំងមូល
                រយៈពេលមួយព្រឹកពេញ។ ដូច្នេះហើយទើបយើងត្រូវបើកបណ្ណាល័យឲ្យបានលឿនជាង
                ជាធម្មតាមិនដូចកាលវិភាគធម្មតារបស់យើងដែលយើងបើកត្រឹមតែថ្ងៃសៅរ៍នោះទេ។
                នាងបានសុំឱ្យខ្ញុំនៅជួយនាង។ ដំបូងខ្ញុំស្ទាក់ស្ទើរ ប៉ុន្តែពេលដែល
                នាងបានពន្យល់ថានាងនៅតែម្នាក់ឯង ហើយត្រូវការអ្នកមនុស្សដើម្បីជួយ
                ត្រួតពិនិត្យនឹងមើលការខុសត្រូវ ខ្ញុំក៏សម្រេចចិត្តយល់ព្រម។
                ខ្ញុំបានសន្យានឹងនាងថាខ្ញុំនឹងមកតាមថ្ងៃកំណត់។
              </p>

              <p className="text-lg leading-relaxed mt-4 italic">
                "ខ្ញំុមិននឹកស្មានថាថ្ងៃនេាះនឹងផ្លាស់ប្ដូរទំនាក់ទំនងរបស់ពួកយើងខ្លាងដល់ថ្នាក់នេះ...។"
              </p>

              <p className="text-lg leading-relaxed mt-4">
                នៅ​ព្រឹក​ថ្ងៃ​ទី​១៦ កុម្ភៈ វេលា​ម៉ោង​៧​និង​២០​នាទី​ព្រឹក
                ខ្ញុំ​បាន​មក​ដល់​តាមការណាត់។ ខ្ញុំ​ឃើញ​នាង​នៅ​ទី​នោះ​ក៏​សួរ​ថា{" "}
                <span className="italic">"អូ នាងមកហើយហ៎លឿនជាងខ្ញំុទៀត"</span>{" "}
                នាងញញឹមហើយនិយាយថា,{" "}
                <span className="italic">"ខ្ញំុស្មានតែមិនមកទេតើ"</span>{" "}
                ខ្ញំុឆ្លើយទាំងអៀនថា,{" "}
                <span className="italic">"សន្យាថាមកហើយមិនមកមិចនឹងកើត..."</span>{" "}
                បន្ទាប់​មកយើងក៏​ចាប់​ផ្តើម​រៀប​ចំ​បន្ទប់​ឱ្យ​បាន​ទាន់​ពេល​វេលា​សម្រាប់​កម្មវិធីថ្នាក់បង្រៀនចិត្តវិទ្យា។
                ខណៈពេលដែលវគ្គចិត្តវិទ្យាកំពុងកើតឡើង យើងបានអង្គុយជជែកគ្នាលេង។
                ស្គាល់គ្នាកាន់តែច្រើន។ ប៉ុន្តែខ្ញុំយល់ថាមានអ្វីមួយ
                ដែរធ្វើអោយនាងមិនសប្បាយចិត្ត។ នាង​ហាក់​ដូច​ជា​ខុស​ប្លែក​ព្រឹកមិញ
                ដូច​ជា​នាង​កំពុង​តែ​ពិបាកចិត្តនឹងអ្វីមួយ។ ដោយឆ្ងល់ និងបារម្ភ
                ខ្ញុំក៏សួរនាងដោយថ្នមៗ{" "}
                <span className="italic">
                  "តើមានរឿងអីមិនសប្បាយចិត្តមែនទេ?
                  អ្នកមើលទៅដូចជាមិនសប្បាយចិត្តអ្វីសេាះ..."
                </span>
              </p>

              <p className="text-lg leading-relaxed mt-4">
                នាងសម្លឹងមកខ្ញំុហើយសួរខ្ញំុថា,{" "}
                <span className="italic">
                  "តើមិនអីទេហ៎ប្រសិនបើខ្ញំុនិយាយប្រាប់អ្នក?"
                </span>{" "}
                ខ្ញំុតបទៅវិញថា,{" "}
                <span className="italic">
                  "មិនអីទេខ្ញំុមិនប្រកាន់ទេ អ្នកអាចប្រាប់ខ្ញំុបាន"
                </span>
              </p>

              <p className="text-lg leading-relaxed mt-4">
                បន្ទាប់ពីស្ទាក់ស្ទើរមួយសន្ទុះ ចុងក្រោយនាងក៏និយាយ,{" "}
                <span className="italic">
                  "តាមពិតទៅ ខ្ញុំមានមិត្តប្រុសម្នាក់។
                  ប៉ុន្តែ​គាត់​ពិត​ដូចជាមិនយកចិត្តទុកដាក់នឹងខ្ញំុសេាះ។
                  គាត់តែងតែធ្វើបាបចិត្តខ្ញំុនឹងមិនដែរខ្វល់ពីខ្ញំុអ្វីបន្តិចសេាះ​
                  គាត់នៅទេបង្កើតកំហុសដដែលៗ ម្ដងហើយម្ដងទៀត។
                  ចឹងទើបបានជាខ្ញំុមានអារម្មណ៍ថាមិនសប្បាយចិត្តអីសេាះ..."
                </span>
              </p>

              <p className="text-lg leading-relaxed mt-4">
                ខ្ញុំស្តាប់នាងដោយការយល់ចិត្ត។ ខ្ញុំយល់ពីនាង
                ហើយខ្ញុំក៏ធ្លាប់មានបទពិសោធន៍ ដូចជានាងអញ្ចឹងដែរ។
                ដូច្នេះ​ហើយ​ខ្ញុំ​សម្រេច​ចិត្ត​នៅ​ក្បែរ​នាង​និយាយ​ជាមួយនាង
                នឹងធ្វើអោយនាងមានអារម្មណ៍ល្អប្រសើឡើងវិញ។
              </p>

              <p className="text-lg leading-relaxed mt-4">
                មួយសន្ទុះក្រោយមក នាងក៏សួរដោយស្នាមញញឹមទន់ភ្លន់ថា,{" "}
                <span className="italic">
                  "តើខ្ញំុអាចសំុអ្នកថតរូបជាមួយបានទេ?
                  ខ្ញំុមិនដែរមានអ្នកណាថតរូបជាលក្ខណ:គូរស្នេហ៍ពីមុនមកទេ..."
                </span>{" "}
                ដោយ​ឃើញ​ទឹក​មុខ​ដ៏​កក់ក្ដៅ​របស់​នាង ខ្ញុំ​ក៏​យល់​ព្រម។
                បន្ទាប់ពីយើងថតរូបរួច នាងបាននិយាយថា{" "}
                <span className="italic">
                  "ខ្ញុំ​ពិត​ជា​សប្បាយ​ចិត្តណាស់។
                  ខ្ញុំ​រីករាយ​ដែល​មាន​មនុស្សដែរនៅចាំ​
                  ស្តាប់ខ្ញុំដោយមិនប្រកាន់នឹងខ្ញំុដូចជាអ្នក...​រូបដែរពួកយើងថតជាមួយគ្នាខ្ញំុនឹងទុកវាជារៀងរហូត។"
                </span>
              </p>

              <p className="text-lg leading-relaxed mt-4">
                នៅ​ពេល​នោះ ខ្ញុំ​មិន​បាន​គិត​អ្វីច្រើនទេ។ ខ្ញុំគ្រាន់តែគិតថាវា
                គឺជាពេលវេលាដ៏សាមញ្ញមួយ សម្រាប់ខ្ញំុតែប៉ុណ្ណេាះ។
              </p>

              <p className="text-lg leading-relaxed mt-4">
                នៅម៉ោងប្រហែល 11:15 ព្រឹក ថ្នាក់រៀនបានបញ្ចប់។ សិស្សទាំងអស់និង
                គ្រូបានធ្វ់ើដំណើរចេញទៅអស់នៅតែពួកយើងពីរនាក់ប៉ុណ្ណោះ។
                ខ្ញុំរៀបនឹងចេញទៅដែរហើយក៏ស្រាប់ទេខ្ញំុបានឃើញនាង ​សម្អាតតែម្នាក់ឯង
                ដូច្នេះខ្ញុំបានសម្រេចចិត្តស្នាក់នៅ និងជួយសម្អាត
                ដោយចេញពីការចិត្តរបស់ខ្ញំុ។ ឃើញដូច្នេះនាងក៏និយាយមកកាន់ខ្ញំុថា{" "}
                <span className="italic">
                  "មិនអីទេបើប្រញ៉ាប់អាចចេញទៅមុនបាន ខ្ញំុអាចនៅសម្អាតម្នាក់ឯងបាន។"
                </span>{" "}
                ខ្ញំុក៏តបទៅវិញថា,{" "}
                <span className="italic">
                  "មិនអីទេខ្ញំុធ្វើនេះគ៏ធ្វើចេញពិចិត្តរបស់ខ្ញំុហើយខ្ញំុក៏មិនចង់បានអ្វីតបស្នងមកវិញដែរ។"
                </span>
              </p>

              <p className="text-lg leading-relaxed mt-4">
                នាងញញឹមយ៉ាងសប្បាយចិត្ត ហើយពួកយើងបន្តសម្អាតជាមួយគ្នា។ I
                បន្ទាប់មកខ្ញំុក៏សួរនាងថា,{" "}
                <span className="italic">
                  {" "}
                  "តើនាងចូលចិត្តកាហ្វេដូចជាខ្ញំុដែរទេ?"
                </span>{" "}
                នាងឆ្លើយ, <span className="italic">"ចាស៎ មែនហើយ!"</span>{" "}
                ខ្ញំុក៏និយាយថា,{" "}
                <span className="italic">
                  "អញ្ចឹងបន្ទាប់ពីសម្អាតរូចខ្ញំុចង់បបួលនាងទៅហាងកាហ្វេមួយកន្លែង
                  តើនាងព្រមទេ?"
                </span>{" "}
                នាងស្ទាក់ស្ទើរបន្តិចអៀនបន្តិច ប៉ុន្តែនៅទីបំផុតនាងក៏យល់ព្រម.
              </p>

              <p className="text-lg leading-relaxed mt-4">
                ម៉ោង 11:30 ព្រឹក យើងក៏បានទៅហាងកាហ្វេជាមួយគ្នា។
                យើងអង្គុយនិយាយគ្នាលេង។ និយាយអំពីអារម្មណ៍
                និងជីវិតប្រចាំថ្ងៃរបស់យើង និងចែករំលែកការលេងសើច និងស្នាមញញឹម
                ស្នាមញញឹមដ៏ស្រស់បំព្រងរបស់នាង វាជាភាពកក់ក្តៅ និងសន្តិភាព​
                របស់ខ្ញំុ បានមួយសន្ទុះធំ
                ពួកក៏សម្រេចចិត្តចែកផ្លូវគ្នាទៅកន្លែងរៀងៗខ្លូន...
              </p>

              <p className="text-lg leading-relaxed mt-4">
                ចាប់ពីពេលនោះ ខ្ញំុតែងតែគិតអំពីនាងគ្រប់ពេលវេលា។ ខ្ញុំមិនដឹងថា
                អារម្មណ៍នេះជាអ្វីទេ អារម្មណ៍មួយដែរច្របូកច្របល់។
                ខ្ញុំតែងតែចង់ឃើញនាងរៀងរាល់ថ្ងៃ ចង់នៅជិតនាង
                ប៉ុន្តែយើងត្រឹមជាអ្នកស្គាល់គ្នាតែប៉ុណ្ណេាះ។
                ប្រសិនបើខ្ញុំមិនបានឃើញនាងមួយថ្ងៃ
                ខ្ញំុមានអារម្មណ៍ថាដូចជាខ្វះអ្វីម្យាង។ ខ្ញុំតែងតែសួរខ្លួនឯងថា
                តើខ្ញុំកំពុងស្រឡាញ់នាងមែនទេ? ស្នាមញញឹមដ៏ស្រស់ស្អាត
                និងសំឡេងសើចដ៏រីករាយរបស់នាង ធ្វើអោយខ្ញំុនឹកនាងខ្លាំងណាស់។
                ប៉ុន្តែខ្ញំុនៅតែគ្មានចម្លើយច្បាស់លាស់សម្រាប់ខ្លួនឯង។
              </p>

              <div className="flex justify-center my-8">
                <div
                  className={`h-px w-1/3 ${
                    theme === "dark" ? "bg-gray-700" : "bg-gray-300"
                  }`}
                ></div>
              </div>
              <p className="text-lg leading-relaxed mt-4 italic">
                "ចាប់ពីពេលនោះមក ទំនាក់ទំនងរវាងពួកយើងចាប់ផ្តើមប្រែប្រួល ពី
                ​អ្នកស្គាល់គ្នា​បាន​ក្លាយ​ជា​មនុស្សពីរនាក់​ដែរមិនអាចខ្វះគ្នាបាន។"
              </p>
            </>
          }
        />

        <ChapterCard
          title="Chapter 2: អ្វីៗចាប់ផ្ដើមផ្លាស់ប្ដូរ"
          date="March 24, 2025"
          content={
            <>
              <p className="text-lg leading-relaxed">
                ថ្ងៃដែរបណ្ណាល័យសាលាបើកដំណើរការឡើងវិញ:
              </p>
              <p className="text-lg leading-relaxed mt-4">
                អស់រយៈពេលជាច្រើនសប្ដាហ៍ សាលារបស់យើងកំពុងកំពុងស្ថិតក្នុងការថែទាំ
                កៅអីខូចៗត្រូវបានជំនួស ហើយមានការត្រួតពិនិត្យគ្រប់ជ្រុងជ្រោយ។
                នៅក្នុងពេលនោះ
                បណ្ណាល័យសាលាត្រូវបានបម្លែងជាការិយាល័យបណ្តោះអាសន្នសម្រាប់គ្រូ។
                សិស្សមិនត្រូវបានអនុញ្ញាតឱ្យចូលទេ ហើយកន្លែងនោះ ដែលធ្លាប់មានសំណើច
                និងភាពស្ងប់ស្ងាត់ ត្រូវបានបិទស្ទើរតែពេញលេញ។
              </p>
              <p className="text-lg leading-relaxed mt-4">
                ខ្ញុំមិនដឹងទេថាខ្ញុំអាចចូលបានរហូតដល់នាងបានប្រាប់ខ្ញុំ។
                “ជាអ្នកធ្វើការស្ម័គ្រចិត្តនៅបណ្ណាល័យ
                អ្នកអាចចូលបានរាល់ពេលដែលអ្នកចង់ចូល។”
              </p>
              <p className="text-lg leading-relaxed mt-4">
                បន្ទាប់មក នៅថ្ងៃច័ន្ទ ទី 24 ខែមីនា មានការប្រកាសមួយបានធ្វើឡើង៖
                បណ្ណាល័យនឹងបើកឡើងវិញ។ សិស្សភាគច្រើនមិនបានចាប់អារម្មណ៍អ្វីឡើយ។
                ប៉ុន្តែសម្រាប់ខ្ញុំ វាជាកន្លែងភ្ជាប់នឹងអនុស្សាវរីយ៍
                ជាការចាប់ផ្ដើមអ្វីមួយដែលខ្ញុំមិនទាន់អាចពិពណ៌នាបាននោះទេ។
              </p>

              <p className="text-lg leading-relaxed mt-4">
                ហើយចាប់ពីថ្ងៃនោះមក អ្វីៗបានចាប់ផ្តើមផ្លាស់។
              </p>
              <p className="text-lg leading-relaxed mt-4">
                រៀងរាល់ថ្ងៃក្រោយម៉ោង 11 ពេលម៉ោងសិក្សាបញ្ចប់
                ខ្ញុំតែងតែដើរចូលទៅបណ្ណាល័យ។
                ពេលខ្ញំុទៅដល់ខ្ញំុឃើញនាងភាគច្រើនស្ថិតនៅទីនោះរួចទៅហើយ—កំពុងអានសៀវភៅ
                រង់ចាំ រៀបចំអ្វីមួយ ឬគ្រាន់តែអង្គុយស្ងៀមស្ងាតរ់តែម្នាក់ឯង។
                ចន្លោះម៉ោង 11 ដល់ 1
                រយៈពេលនោះបានក្លាយជាផ្នែកមួយនៃជីវិតប្រចាំថ្ងៃរបស់ខ្ញុំ។
                ខ្ញំុតែងតែទៅនិយាយលេងជាមួយនាងចែករំលែកអំពីការសិក្សាជាមួយគ្នាខ្ញំុពិតជាមានក្ដីសុខណាស់ពេលដែរខ្ញំុឃើញស្នាមញញឹមដ៏ស្រស់ស្អាតរបស់នាង
                សម្លេងសើចទៅលើរឿងតូចៗដែរពួកយើងធ្វើជាមួយគ្នាវាជាពេលមួយដែរខ្ញំិមានក្ដីសុខបំផុតនៅក្នុងជីវិតរបស់ខ្ញំុ។
              </p>
              <p className="text-lg leading-relaxed mt-4">
                ពេលខ្លះយើងនិយាយគ្នា យើងសើចលេងគ្នា
                ខ្លះទៀតគ្មានការចាំបាច់និយាយអ្វីឡើយ។
                យើងអង្គុយនៅជិតគ្នានៅក្នុងភាពស្ងៀម ប៉ុន្តែបរិយាកាសនៅពេលនេាះ
                នៅតែមានអារម្មណ៍ថាកក់ក្ដៅ។
              </p>

              <p className="text-lg leading-relaxed mt-4">
                បណ្ណាល័យមិនមែនជាកន្លែងពិសេសសម្រាប់សិស្សភាគច្រើនឡើយ។
                គ្រាន់តែជាបន្ទប់មួយដែលមានសៀវភៅ និងកៅអីប៉ុណ្ណោះ។
                ប៉ុន្តែសម្រាប់ខ្ញុំ ចន្លោះម៉ោងស្ងៀមៗពី 11 ដល់ 1 នោះ
                វាជាកន្លែងដែលអ្វីៗបានចាប់ផ្តើមផ្លាស់ប្តូរ។
                គ្រាន់តែរវាងយើងពីរនាក់ប៉ុណ្ណោះ។
              </p>

              <p className="text-lg leading-relaxed mt-4">
                អស់ខែច្រើន យើងគ្រាន់តែជាមិត្ត។ មិត្តម្នាក់ដែលយល់ចិត្តអស់បេះដូង
                មិត្តម្នាក់ដែលដឹងអ្វីៗទាំងអស់។
                ខ្ញុំគ្រាន់តែជាមិត្តម្នាក់ដែលនៅទីនោះនៅពេលនាងត្រូវការអ្នកស្តាប់
                អ្នកយកចិត្តទុកដាក់ អ្នកនៅជាមួយ។
                ខ្ញុំមិនដែលគិតថានឹងឆ្លងខ្សែបន្ទាត់នោះឡើយ
                មិនដែលគិតថានឹងធ្វើឲ្យវាយកលើសពីមិត្តភាព។
                ខ្ញុំគ្រាន់តែជានរណាម្នាក់ដែលនាងអាចពឹងផ្អែកបាន
                ម្នាក់ដែលយល់នាងដោយមិនចាំបាច់និយាយច្រើន។
                រហូតដល់…ខ្ញុំបានឆ្លងបន្ទាត់នោះទៅ
              </p>
            </>
          }
        />
      </div>
    </div>
  );
};

export default StoriesKH;
